#### DocumentEntryPoint Members

---

|  |
| --- |
| DocumentEntryPoint Class   Constructors   Methods   Properties   Events   See Also |

The  DocumentEntryPoint  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | DocumentEntryPoint | Initializes a new instance of the  DocumentEntryPoint  class |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | AcquireCoordinates | Acquires coordinates from the specified link instance. (Inherited from  Document  .) |
| Public method | AutoJoinElements | Forces the elements in the Revit document to automatically join to their neighbors where appropriate. (Inherited from  Document  .) |
| Public method | CanEnableCloudWorksharing | Checks if cloud worksharing can be enabled for the cloud model. (Inherited from  Document  .) |
| Public method | CanEnableWorksharing | Checks if worksharing can be enabled in the document. (Inherited from  Document  .) |
| Public method | Close | Closes the document, save the changes if there are. (Inherited from  Document  .) |
| Public method | Close(Boolean) | Closes the document with the option to save. (Inherited from  Document  .) |
| Public method | CombineElements | Combine a set of combinable elements into a geometry combination. (Inherited from  Document  .) |
| Public method | ConvertDetailToModelCurves | Converts a group of DetailCurves to equivalent ModelCurves. (Inherited from  Document  .) |
| Public method | ConvertModelToDetailCurves | Converts a group of ModelCurves to equivalent DetailCurves. (Inherited from  Document  .) |
| Public method | ConvertModelToSymbolicCurves | Converts a group of ModelCurves to equivalent SymbolicCurves. (Inherited from  Document  .) |
| Public method | ConvertSymbolicToModelCurves | Converts a group of SymbolicCurves to equivalent ModelCurves. (Inherited from  Document  .) |
| Public method | Delete(ElementId) | Deletes an element from the document given the id of that element. (Inherited from  Document  .) |
| Public method | Delete(ICollection ElementId ) | Deletes a set of elements from the document. (Inherited from  Document  .) |
| Public method | Dispose | (Inherited from  Document  .) |
| Public method | EditFamily | Gets the document of a loaded family to edit. (Inherited from  Document  .) |
| Public method | EnableCloudWorksharing | Enables cloud worksharing for a cloud model (Inherited from  Document  .) |
| Public method | EnableWorksharing | Enables worksharing in the document. (Inherited from  Document  .) |
| Public method | Equals | Determines whether the specified  Object  equals to this  Object  . (Inherited from  Document  .) |
| Public method | EraseSchemaAndAllEntities | Erases Schema and all its Entities from the document. (Inherited from  Document  .) |
| Public method | Export(String, IList ElementId , PDFExportOptions) | Exports a selection of views in PDF format. (Inherited from  Document  .) |
| Public method | Export(String, String, MassGBXMLExportOptions) | **Obsolete.**   Exports a gbXML file from a mass model document. (Inherited from  Document  .) |
| Public method | Export(String, String, GBXMLExportOptions) | Export the model in gbXML (green-building) format. (Inherited from  Document  .) |
| Public method | Export(String, String, IFCExportOptions) | Exports the document to the Industry Standard Classes (IFC) format. (Inherited from  Document  .) |
| Public method | Export(String, String, NavisworksExportOptions) | Exports a Revit project to the Navisworks .nwc format. (Inherited from  Document  .) |
| Public method | Export(String, String, OBJExportOptions) | Exports a view specified in the export options to the OBJ format. (Inherited from  Document  .) |
| Public method | Export(String, String, STLExportOptions) | Exports a view specified in the export options to the STL format. (Inherited from  Document  .) |
| Public method | Export(String, String, ViewSet, DWFExportOptions) | Exports the current view or a selection of views in DWF format. (Inherited from  Document  .) |
| Public method | Export(String, String, ViewSet, DWFXExportOptions) | Exports the current view or a selection of views in DWFX format. (Inherited from  Document  .) |
| Public method | Export(String, String, ViewSet, FBXExportOptions) | Exports the document in 3D-Studio Max (FBX) format. (Inherited from  Document  .) |
| Public method | Export(String, String, ICollection ElementId , DGNExportOptions) | Exports a selection of views in DGN format. (Inherited from  Document  .) |
| Public method | Export(String, String, ICollection ElementId , DWGExportOptions) | Exports a selection of views in DWG format. (Inherited from  Document  .) |
| Public method | Export(String, String, ICollection ElementId , DXFExportOptions) | Exports a selection of views in DXF format. (Inherited from  Document  .) |
| Public method | Export(String, String, ICollection ElementId , SATExportOptions) | Exports the current view or a selection of views in SAT format. (Inherited from  Document  .) |
| Public method | ExportImage | Exports a view or set of views into an image file. (Inherited from  Document  .) |
| Public method | FinishInitializationEO | For Revit Macros internal use only. |
| Public method | GetChangedElements | Extracts a collection containing the ids of elements that have been created, modified or deleted between the input baseVersion and the document's current version. (Inherited from  Document  .) |
| Public method | GetCloudFolderId | Gets ForgeDM folder id where the model locates. (Inherited from  Document  .) |
| Public method | GetCloudModelPath | Gets the cloud model path of the cloud model. (Inherited from  Document  .) |
| Public method | GetCloudModelUrn | A ForgeDM Urn identifying the model. (Inherited from  Document  .) |
| Public method | GetDefaultElementTypeId | Gets the default element type id with the given DefaultElementType id. (Inherited from  Document  .) |
| Public method | GetDefaultFamilyTypeId | Gets the default family type id with the given family category id. (Inherited from  Document  .) |
| Public method | GetDocumentPreviewSettings | Returns the preview settings for the given document. (Inherited from  Document  .) |
| Public method | GetElement(String) | Gets the Element referenced by a unique id string. (Inherited from  Document  .) |
| Public method | GetElement(ElementId) | Gets the Element referenced by the input ElementId. (Inherited from  Document  .) |
| Public method | GetElement(Reference) | Gets the Element referenced by the input reference. (Inherited from  Document  .) |
| Public method | GetHashCode | Gets the hash code of this document instance. (Inherited from  Document  .) |
| Public method | GetHubId | Gets ForgeDM hub id where the model locates. It is cached in session. (Inherited from  Document  .) |
| Public method | GetPaintedMaterial | Get the material painted on the element's face. Returns invalidElementId if the face is not painted. (Inherited from  Document  .) |
| Public method | GetPrintSettingIds | Retrieves all Print Settings of current project. (Inherited from  Document  .) |
| Public method | GetProjectId | Gets ForgeDM project id where the model locates. (Inherited from  Document  .) |
| Public method | GetRoomAtPoint(XYZ) | Gets a room containing the point. (Inherited from  Document  .) |
| Public method | GetRoomAtPoint(XYZ, Phase) | Gets a room containing the point. (Inherited from  Document  .) |
| Public method | GetSpaceAtPoint(XYZ) | Gets a space containing the point. (Inherited from  Document  .) |
| Public method | GetSpaceAtPoint(XYZ, Phase) | Gets a space containing the point. (Inherited from  Document  .) |
| Public method | GetSubelement(String) | Gets the subelement referenced by a unique id string. (Inherited from  Document  .) |
| Public method | GetSubelement(Reference) | Gets the subelement referenced by the input reference. (Inherited from  Document  .) |
| Public method | GetSubelement(ElementId, Int32) | Gets the subelement referenced by a parent id and subelement id. (Inherited from  Document  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | GetTypeOfStorage | Get the storage type of the identified built-in parameter. (Inherited from  Document  .) |
| Public method | GetUnits | Gets the Units object. (Inherited from  Document  .) |
| Public method | GetWarnings | Returns list of failure messages generated from persistent (reviewable) warnings accumulated in the document. (Inherited from  Document  .) |
| Public method | GetWorksetId | Get Id of the Workset which owns the element. (Inherited from  Document  .) |
| Public method | GetWorksetTable | Get the WorksetTable of this document. (Inherited from  Document  .) |
| Public method | GetWorksharingCentralModelPath | Gets the central model path of the worksharing model. (Inherited from  Document  .) |
| Public method | HasAllChangesFromCentral | Returns whether the model in the current session is up to date with central. (Inherited from  Document  .) |
| Public method | Import(String, GBXMLImportOptions) | Imports a Green-Building XML file into the document. (Inherited from  Document  .) |
| Public method | Import(String, AXMImportOptions, View) | Imports an AXM file into the document. (Inherited from  Document  .) |
| Public method | Import(String, ImportOptions3DM, View) | Imports a 3DM file into the document. (Inherited from  Document  .) |
| Public method | Import(String, OBJImportOptions, View) | Imports an OBJ file into the document. (Inherited from  Document  .) |
| Public method | Import(String, SATImportOptions, View) | Imports an SAT file into the document. (Inherited from  Document  .) |
| Public method | Import(String, SKPImportOptions, View) | Imports a SKP file into the document. (Inherited from  Document  .) |
| Public method | Import(String, STLImportOptions, View) | Imports an STL file into the document. (Inherited from  Document  .) |
| Public method | Import(String, DGNImportOptions, View, ElementId ) | Imports a DGN file to the document. (Inherited from  Document  .) |
| Public method | Import(String, DWGImportOptions, View, ElementId ) | Imports a DWG or DXF file to the document. (Inherited from  Document  .) |
| Public method | Initialize | For Revit Macros internal use only. |
| Public method | IsBackgroundCalculationInProgress | Indicates whether there are any background calculations in progress for this document. (Inherited from  Document  .) |
| Public method | IsDefaultElementTypeIdValid | Checks whether the element type id is valid for the give DefaultElmentType id. (Inherited from  Document  .) |
| Public method | IsDefaultFamilyTypeIdValid | Checks whether the family type id is valid for the give family category. (Inherited from  Document  .) |
| Public method | IsPainted | Checks if the element's face is painted with a material. (Inherited from  Document  .) |
| Public method | Link(String, DWFImportOptions) | Links Markups in a DWF file into the project document. (Inherited from  Document  .) |
| Public method | Link(String, ImportOptions3DM, View) | Links a 3DM file into the project document. (Inherited from  Document  .) |
| Public method | Link(String, OBJImportOptions, View) | Links an OBJ file into the project document. (Inherited from  Document  .) |
| Public method | Link(String, SATImportOptions, View) | Links an SAT file into the project document. (Inherited from  Document  .) |
| Public method | Link(String, SKPImportOptions, View) | Links a SKP file into the project document. (Inherited from  Document  .) |
| Public method | Link(String, STLImportOptions, View) | Links an STL file into the project document. (Inherited from  Document  .) |
| Public method | Link(String, DGNImportOptions, View, ElementId ) | Links a DGN file into the project document. (Inherited from  Document  .) |
| Public method | Link(String, DWGImportOptions, View, ElementId ) | Links a DWG or DXF file into the project document. (Inherited from  Document  .) |
| Public method | LoadFamily(String) | Loads an entire family and all its types/symbols into the document. (Inherited from  Document  .) |
| Public method | LoadFamily(Document) | Loads the contents of this family document into another document. (Inherited from  Document  .) |
| Public method | LoadFamily(String, Family ) | Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family. (Inherited from  Document  .) |
| Public method | LoadFamily(Document, IFamilyLoadOptions) | Loads the contents of this family document into another document. (Inherited from  Document  .) |
| Public method | LoadFamily(String, IFamilyLoadOptions, Family ) | Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family. (Inherited from  Document  .) |
| Public method | LoadFamilySymbol(String, String) | Loads only a specified family type/symbol from a family file into the document. (Inherited from  Document  .) |
| Public method | LoadFamilySymbol(String, String, FamilySymbol ) | Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol. (Inherited from  Document  .) |
| Public method | LoadFamilySymbol(String, String, IFamilyLoadOptions, FamilySymbol ) | Loads only the specified family type/symbol from a family file into the document and provides a reference to the loaded family symbol. (Inherited from  Document  .) |
| Public method | MakeTransientElements | This method encapsulates the process of creating transient elements in the document. (Inherited from  Document  .) |
| Public method | OnShutdownEO | For Revit Macros internal use only. |
| Public method | Paint(ElementId, Face, ElementId) | Paint the element's face with specified material. (Inherited from  Document  .) |
| Public method | Paint(ElementId, Face, FamilyParameter) | Paint the element's face with specified material. (Inherited from  Document  .) |
| Public method | PostFailure | Posts a failure to be displayed to the user at the end of transaction. (Inherited from  Document  .) |
| Public method | Print(ViewSet) | Prints a set of views with default view template and default print settings. (Inherited from  Document  .) |
| Public method | Print(ViewSet, View) | Prints a set of views with a specified view template and default print settings. (Inherited from  Document  .) |
| Public method | Print(ViewSet, Boolean) | Prints a set of views with default view template and default print settings. (Inherited from  Document  .) |
| Public method | Print(ViewSet, View, Boolean) | Prints a set of views with a specified view template and default print settings. (Inherited from  Document  .) |
| Public method | PublishCoordinates | Publish coordinates to the specified ProjectLocation of the link instance. (Inherited from  Document  .) |
| Public method | Regenerate | Updates the elements in the Revit document to reflect all changes. (Inherited from  Document  .) |
| Public method | ReloadLatest | Fetches changes from central (due to one or more synchronizations with central) and merges them into the current session. (Inherited from  Document  .) |
| Public method | RemovePaint | Remove the material painted on the element's face. If the face is currently not painted,it will do nothing. (Inherited from  Document  .) |
| Public method | ResetSharedCoordinates | Reset shared coordinates for the host model/file. (Inherited from  Document  .) |
| Public method | Save | Saves the document. (Inherited from  Document  .) |
| Public method | Save(SaveOptions) | Saves the document. (Inherited from  Document  .) |
| Public method | SaveAs(String) | Saves the document to a given file path. (Inherited from  Document  .) |
| Public method | SaveAs(String, SaveAsOptions) | Saves the document to a given file path. (Inherited from  Document  .) |
| Public method | SaveAs(ModelPath, SaveAsOptions) | Saves the document to a given path. (Inherited from  Document  .) |
| Public method | SaveAsCloudModel | Saves current non-workshared or workshared model as a cloud model or workshared cloud model in BIM 360 Docs or Autodesk Docs. (Inherited from  Document  .) |
| Public method | SaveCloudModel | Saves cloud model. (Inherited from  Document  .) |
| Public method | SaveToProjectAsImage | Creates an image view from the currently active view. (Inherited from  Document  .) |
| Public method | SeparateElements | Separate a set of combinable elements out of combinations they currently belong to. (Inherited from  Document  .) |
| Public method | SetDefaultElementTypeId | Sets the default element type id of the given DefaultElementType id. (Inherited from  Document  .) |
| Public method | SetDefaultFamilyTypeId | Sets the default family type id for the given family category. (Inherited from  Document  .) |
| Public method | SetUnits | Sets the units. (Inherited from  Document  .) |
| Public method | SynchronizeWithCentral | Performs reload latest until the model in the current session is up to date and then saves changes back to central. A save to central is performed even if no changes were made. (Inherited from  Document  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |
| Public method | UnpostFailure | Deletes the posted failure message associated with a given FailureMessageKey. (Inherited from  Document  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ActiveProjectLocation | Retrieve the active project location. (Inherited from  Document  .) |
| Public property | ActiveView | The document's active view. (Inherited from  Document  .) |
| Public property | AddinFolder | The full path to the Revit Macros module. |
| Public property | Application | Returns the Application in which the Document resides. (Inherited from  Document  .) |
| Public property | Create | An object that can be used to create new instances of Autodesk Revit API elements within a project. (Inherited from  Document  .) |
| Public property | DisplayUnitSystem | Provides access to display unit type with in the document. (Inherited from  Document  .) |
| Public property | FamilyCreate | An object that can be used to create new instances of Autodesk Revit API elements within a family document. (Inherited from  Document  .) |
| Public property | FamilyManager | The family manager object provides access to family types and parameters. (Inherited from  Document  .) |
| Public property | IsDetached | Identifies if a workshared document is detached. Also, see  IsWorkshared (Inherited from  Document  .) |
| Public property | IsFamilyDocument | Identifies if the current document is a family document. (Inherited from  Document  .) |
| Public property | IsLinked | Identifies if a document is a linked RVT. (Inherited from  Document  .) |
| Public property | IsModelInCloud | Identifies if document is stored on Autodesk cloud services. (Inherited from  Document  .) |
| Public property | IsModifiable | Identifies if the document is modifiable. (Inherited from  Document  .) |
| Public property | IsModified | The state of changes made to the document. (Inherited from  Document  .) |
| Public property | IsReadOnly | Identifies if the document is read-only or can possibly be modified. (Inherited from  Document  .) |
| Public property | IsReadOnlyFile | Signals whether the document was opened from a read-only file. (Inherited from  Document  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  Document  .) |
| Public property | IsWorkshared | Identifies if worksharing (i.e. editing permissions and multiple worksets) have been enabled in the document. Also, see  IsDetached (Inherited from  Document  .) |
| Public property | MassDisplayTemporaryOverride | This setting controls temporary display in views of objects with mass category or subcategories. (Inherited from  Document  .) |
| Public property | MullionTypes | This property is used to retrieve all the mullion types in current system. (Inherited from  Document  .) |
| Public property | OwnerFamily | Get the Family of this Family Document. (Inherited from  Document  .) |
| Public property | PanelTypes | Retrieves a set of PanelType objects that contains all the panel types that are currently loaded into the project. (Inherited from  Document  .) |
| Public property | ParameterBindings | Retrieves an object from which mappings between parameter definitions and categories can be found. (Inherited from  Document  .) |
| Public property | PathName | The fully qualified path of the document's disk file. (Inherited from  Document  .) |
| Public property | Phases | Retrieves all of the phases in the document. (Inherited from  Document  .) |
| Public property | PlanTopologies | Get the PlanTopologies of the current project in the last phase. (Inherited from  Document  .) |
| Public property | PlanTopologies Phase | Gets the PlanTopologies of the current project in a given phase. (Inherited from  Document  .) |
| Public property | PlanTopology Level | Get the PlanTopology of a given level in the last phase. (Inherited from  Document  .) |
| Public property | PlanTopology Level, Phase | Get the PlanTopology of a given level in a given phase. (Inherited from  Document  .) |
| Public property | PrintManager | Retrieve the PrintManager of current project. (Inherited from  Document  .) |
| Public property | ProjectInformation | Return the Project Information of the current project. (Inherited from  Document  .) |
| Public property | ProjectLocations | Retrieve all the project locations associated with this project (Inherited from  Document  .) |
| Public property | ReactionsAreUpToDate | Reports if the analytical model has regenerated in a document with reaction loads. (Inherited from  Document  .) |
| Public property | Settings | Provides access to general application settings, such as Categories. (Inherited from  Document  .) |
| Public property | SiteLocation | Returns the site location information. (Inherited from  Document  .) |
| Public property | Title | The document's title. (Inherited from  Document  .) |
| Public property | TypeOfStorage | Get the storage type of the specified BuiltInParameter. (Inherited from  Document  .) |
| Public property | WorksharingCentralGUID | The central GUID of the server-based model. (Inherited from  Document  .) |

# Events

|  | Name | Description |
| --- | --- | --- |
| Public event | DocumentClosing | Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document. (Inherited from  Document  .) |
| Public event | DocumentPrinted | Subscribe to the DocumentPrinted event to be notified immediately after Revit has finished printing a view or ViewSet of the document. (Inherited from  Document  .) |
| Public event | DocumentPrinting | Subscribe to the DocumentPrinting event to be notified when Revit is just about to print a view or ViewSet of the document. (Inherited from  Document  .) |
| Public event | DocumentSaved | Subscribe to the DocumentSaved event to be notified immediately after Revit has finished saving a document. (Inherited from  Document  .) |
| Public event | DocumentSavedAs | Subscribe to the DocumentSavedAs event to be notified immediately after Revit has finished saving document with a new file name. (Inherited from  Document  .) |
| Public event | DocumentSaving | Subscribe to the DocumentSaving event to be notified when Revit is just about to save a document. (Inherited from  Document  .) |
| Public event | DocumentSavingAs | Subscribe to the DocumentSavingAs event to be notified when Revit is just about to save the document with a new file name. (Inherited from  Document  .) |
| Public event | ViewPrinted | Subscribe to the ViewPrinted event to be notified immediately after Revit has finished printing a view of the document. (Inherited from  Document  .) |
| Public event | ViewPrinting | Subscribe to the ViewPrinting event to be notified when Revit is just about to print a view of the document. (Inherited from  Document  .) |

# See Also

DocumentEntryPoint Class

Autodesk.Revit.DB.Macros Namespace